// let name = prompt('Your name', 'wefgr'); 

// alert(`Привет, ${name}!`); 

//------------------------------------------
// Постфиксная и префиксная формы

// let a = 1, b = 1;
// let c = 2;
// let d = 1;

//------------------------------------------
// Результат присваивания
// a = 2
// x = 5


//-----------------------------------------
// Преобразование типов
// 1. 1
// 2. -1
// 3. 1
// 4. 2
// 5. 6
// 6. 10
// 7. 10
// 8. 45
// 9. NaN
// 10. -95
// 11. 95
// 12. 1
// 13. NaN
// 14. -1

//----------------------------------------
// Исправьте сложение

// let a = prompt('Первое число?', 1);
// let b = prompt('Второе число',2);

// let sum = Number(a) + Number(b);

// alert(sum);

//-----------------------------------------
// Работа с переменными

// 1
// let num = 3;
// alert(num);

//  2
// let a = 10;
// let b = 2;
// alert("Сумма: " + (a + b) + "\nРазность: " + (a - b) + "\nПроизведение: " + (a * b) + "\nЧастное: " + (a / b));

//  3
// let c = 15;
// let d = 2;
// let result = c + d;
// alert(result);

//  4
// let a1 = 10, b1 = 2, c1 = 5;
// alert("Сумма: " + (a1 + b1 + c1));

//  5
// let a2 = 17, b2 = 10;
// let c2 = a2 - b2;
// let d2 = 7;
// let result2 = c2 + d2;
// alert(result2);


//-------------------------------------------------
// Работа со строками

//  1
// let str = 'Привет, Мир!';
// alert(str);

//  2
// let str1 = 'Привет, ';
// let str2 = 'Мир!';
// alert(str1 + str2);

//  3
// let name = 'Степан'; 
// alert('Привет, ' + name + '!');

//  4
// let age = '16'; 
// alert('Мне ' + age + ' лет!');


//--------------------------------------------------
// Функция prompt

// let name = prompt('Введите ваше имя!', 'Степан')
// alert('Ваше имя' + name)
// let num = prompt('Введите число', 123)
// let square = num * num
// alert('Квадрат:' + square)


//----------------------------------------
/*Обращение к символам строки*/

//  1
// let str = 'abcde';
// alert('Символ a: ' + str[0] + '\nСимвол c: ' + str[2] + '\nСимвол e: ' + str[4]);

//  2
// let num = '12345';
// let result = Number(num[0]) * Number(num[1]) * Number(num[2]) * Number(num[3]) * Number(num[4]);
// alert('Произведение цифр числа ' + num + ': ' + result);


//-------------------------------------
/*Практика*/

// 1
// let Hour = 60 * 60;
// let Day = Hour * 24;
// let Month = Day * 30; 
// alert('Количество секунд в часе: ' + Hour + '\nКоличество секунд в сутках: ' + Day + '\nКоличество секунд в месяце: ' + Month);

// 2
// let hour = 12;
// let minute = 34;
// let second = 56;
// alert('Текущее время: ' + hour + ':' + minute + ':' + second);

// 3
// let num = 5; 
// let square = num * num;
// alert(num + ' в квадрате равно: ' + square);


//--------------------------------------
/*Работа с присваиванием и декрментами*/

// 1
// let num = 47;
// num += 7;
// num -= 18;
// num *= 10;
// num /= 15;
// alert(num);

// 2
// let num = 10;
// num++;
// num++;
// num--;
// alert(num);